Revit 2015 API
ViewCropRegionShapeManager Methods
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCropRegionShape
 Gets the crop region boundaries.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCropRegionShapeValid
 Verifies that boundaries represent one closed curve loop without self-intersections, consisting of non-zero length straight lines in plane parallel to the view plane. Curves in boundaries use model coordinates.
RemoveCropRegionShape
 Removes boundaries of crop region.
RemoveSplit
 Removes split settings of crop region.
SetCropRegionEmptyShape
 Sets crop region of empty shape making possible interactive sketching.
SetCropRegionShape
 Sets boundaries of crop region.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace